---
kind: property
id: P:Autodesk.Revit.DB.RoutingPreferenceRule.Description
source: html/34b4905c-6336-3a3b-60d0-0f3dadf0615b.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRule.Description Property

The description of the routing preference rule.

## Syntax (C#)
```csharp
public string Description { get; }
```